trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
/*****************************************************************************************
 *
 * @file app_hogpd_defs.h
 *
 * @brief HID report map definitions.
 * 
******************************************************************************************/

#ifndef _APP_HOGPD_DEFS_H_
#define _APP_HOGPD_DEFS_H_

#include "rwip_config.h"
#include "hogp_common.h"
#include "hogpd_task.h"

typedef void (*store_attribute_callback_t)(uint16_t uuid, int attr_num, int value);

typedef struct {
    bool boot_protocol_mode;
    bool batt_external_report;
    bool remote_wakeup;
    bool normally_connectable;
    store_attribute_callback_t store_attribute_callback;
} hogpd_params_t;

typedef struct {
    uint8_t id;
    uint8_t cfg;
    uint16_t size;
    void (*read_callback)(uint8_t conidx, uint8_t *report_data, uint16_t *report_length);
    void (*write_callback)(uint8_t conidx, struct hogpd_report_info *report_info);
} hogpd_reports_t;

#define HID_USAGE_PAGE_SENSOR									 0x05,0x20
                                                                 
//sensor category usages                                         
#define HID_USAGE_SENSOR_TYPE_COLLECTION						 0x09,0x01
                                                                 
//sensor category biometric                                      
#define HID_USAGE_SENSOR_CATEGORY_BIOMETRIC						 0x09,0x10
#define HID_USAGE_SENSOR_TYPE_BIOMETRIC_PRESENCE				 0x09,0x11
#define HID_USAGE_SENSOR_TYPE_BIOMETRIC_PROXIMITY				 0x09,0x12
#define HID_USAGE_SENSOR_TYPE_BIOMETRIC_TOUCH					 0x09,0x13
                                                                 
//sensor category electrical                                     
#define HID_USAGE_SENSOR_CATEGORY_ELECTRICAL					 0x09,0x20
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_CAPACITANCE			 0x09,0x21
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_CURRENT				 0x09,0x22
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_POWER					 0x09,0x23
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_INDUCTANCE				 0x09,0x24
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_RESISTANCE				 0x09,0x25
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_VOLTAGE				 0x09,0x26
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_POTENTIOMETER			 0x09,0x27
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_FREQUENCY				 0x09,0x28
#define HID_USAGE_SENSOR_TYPE_ELECTRICAL_PERIOD					 0x09,0x29
                                                                 
//sensor category environmental                                  
#define HID_USAGE_SENSOR_CATEGORY_ENVIRONMENTAL					 0x09,0x30
#define HID_USAGE_SENSOR_TYPE_ENVIRONMENTAL_ATMOSPHERIC_PRESSURE 0x09,0x31
#define HID_USAGE_SENSOR_TYPE_ENVIRONMENTAL_HUMIDITY			 0x09,0x32
#define HID_USAGE_SENSOR_TYPE_ENVIRONMENTAL_TEMPERATURE			 0x09,0x33
#define HID_USAGE_SENSOR_TYPE_ENVIRONMENTAL_WIND_DIRECTION		 0x09,0x34
#define HID_USAGE_SENSOR_TYPE_ENVIRONMENTAL_WIND_SPEED			 0x09,0x35
                                                                 
//sensor category light                                          
#define HID_USAGE_SENSOR_CATEGORY_LIGHT							 0x09,0x40
#define HID_USAGE_SENSOR_TYPE_LIGHT_AMBIENTLIGHT				 0x09,0x41
#define HID_USAGE_SENSOR_TYPE_LIGHT_CONSUMER_INFRARED			 0x09,0x42
                                                                 
//sensor category location                                       
#define HID_USAGE_SENSOR_CATEGORY_LOCATION						 0x09,0x50
#define HID_USAGE_SENSOR_TYPE_LOCATION_BROADCAST				 0x09,0x51
#define HID_USAGE_SENSOR_TYPE_LOCATION_DEAD_RECKONING			 0x09,0x52
#define HID_USAGE_SENSOR_TYPE_LOCATION_GPS						 0x09,0x53
#define HID_USAGE_SENSOR_TYPE_LOCATION_LOOKUP					 0x09,0x54
#define HID_USAGE_SENSOR_TYPE_LOCATION_OTHER					 0x09,0x55
#define HID_USAGE_SENSOR_TYPE_LOCATION_STATIC					 0x09,0x56
#define HID_USAGE_SENSOR_TYPE_LOCATION_TRIANGULATION			 0x09,0x57
                                                                 
//sensor category mechanical                                     
#define HID_USAGE_SENSOR_CATEGORY_MECHANICAL					 0x09,0x60
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_BOOLEAN_SWITCH			 0x09,0x61
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_BOOLEAN_SWITCH_ARRAY	 0x09,0x62
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_MULTIVALUE_SWITCH		 0x09,0x63
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_FORCE					 0x09,0x64
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_PRESSURE				 0x09,0x65
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_STRAIN					 0x09,0x66
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_SCALE_WEIGHT			 0x09,0x67
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_VIBRATOR				 0x09,0x68
#define HID_USAGE_SENSOR_TYPE_MECHANICAL_HALL_EFFECT_SWITCH		 0x09,0x69
                                                                 
//sensor category motion                                         
#define HID_USAGE_SENSOR_CATEGORY_MOTION						 0x09,0x70
#define HID_USAGE_SENSOR_TYPE_MOTION_ACCELEROMETER_1D			 0x09,0x71
#define HID_USAGE_SENSOR_TYPE_MOTION_ACCELEROMETER_2D			 0x09,0x72
#define HID_USAGE_SENSOR_TYPE_MOTION_ACCELEROMETER_3D			 0x09,0x73
#define HID_USAGE_SENSOR_TYPE_MOTION_GYROMETER_1D				 0x09,0x74
#define HID_USAGE_SENSOR_TYPE_MOTION_GYROMETER_2D				 0x09,0x75
#define HID_USAGE_SENSOR_TYPE_MOTION_GYROMETER_3D				 0x09,0x76
#define HID_USAGE_SENSOR_TYPE_MOTION_MOTION_DETECTOR			 0x09,0x77
#define HID_USAGE_SENSOR_TYPE_MOTION_SPEEDOMETER				 0x09,0x78
#define HID_USAGE_SENSOR_TYPE_MOTION_ACCELEROMETER				 0x09,0x79
#define HID_USAGE_SENSOR_TYPE_MOTION_GYROMETER					 0x09,0x7A
                                                                 
//sensor category orientation                                    
#define HID_USAGE_SENSOR_CATEGORY_ORIENTATION					 0x09,0x80
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_COMPASS_1D			 0x09,0x81
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_COMPASS_2D			 0x09,0x82
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_COMPASS_3D			 0x09,0x83
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_INCLINOMETER_1D		 0x09,0x84
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_INCLINOMETER_2D		 0x09,0x85
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_INCLINOMETER_3D		 0x09,0x86
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_DISTANCE_1D			 0x09,0x87
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_DISTANCE_2D			 0x09,0x88
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_DISTANCE_3D			 0x09,0x89
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_DEVICE_ORIENTATION	 0x09,0x8A
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_COMPASS				 0x09,0x8B
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_INCLINOMETER			 0x09,0x8C
#define HID_USAGE_SENSOR_TYPE_ORIENTATION_DISTANCE				 0x09,0x8D
                                                                 
