trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
//sensor category scanner                                        
#define HID_USAGE_SENSOR_CATEGORY_SCANNER						 0x09,0x90
#define HID_USAGE_SENSOR_TYPE_SCANNER_BARCODE					 0x09,0x91
#define HID_USAGE_SENSOR_TYPE_SCANNER_RFID						 0x09,0x92
#define HID_USAGE_SENSOR_TYPE_SCANNER_NFC						 0x09,0x93
                                                                 
//sensor category time                                           
#define HID_USAGE_SENSOR_CATEGORY_TIME							 0x09,0xA0
#define HID_USAGE_SENSOR_TYPE_TIME_ALARM						 0x09,0xA1
#define HID_USAGE_SENSOR_TYPE_TIME_RTC							 0x09,0xA2
                                                                 
//sensor category other                                          
#define HID_USAGE_SENSOR_CATEGORY_OTHER							 0x09,0xE0
#define HID_USAGE_SENSOR_TYPE_OTHER_CUSTOM						 0x09,0xE1
#define HID_USAGE_SENSOR_TYPE_OTHER_GENERIC						 0x09,0xE2
#define HID_USAGE_SENSOR_TYPE_OTHER_GENERIC_ENUMERATOR			 0x09,0xE3
                                                                 
//unit usages                                                    
#define HID_USAGE_SENSOR_UNITS_NOT_SPECIFIED					 0x65,0x00
#define HID_USAGE_SENSOR_UNITS_LUX								 0x67,0xE1,0x00,0x00,0x01
#define HID_USAGE_SENSOR_UNITS_KELVIN							 0x67,0x01,0x00,0x01,0x00
#define HID_USAGE_SENSOR_UNITS_FAHRENHEIT						 0x67,0x03,0x00,0x01,0x00
#define HID_USAGE_SENSOR_UNITS_PASCAL							 0x66,0xF1,0xE1
#define HID_USAGE_SENSOR_UNITS_NEWTON							 0x66,0x11,0xE1
#define HID_USAGE_SENSOR_UNITS_METERS_PER_SECOND				 0x66,0x11,0xF0
#define HID_USAGE_SENSOR_UNITS_METERS_PER_SEC_SQRD				 0x66,0x11,0xE0
#define HID_USAGE_SENSOR_UNITS_FARAD							 0x67,0xE1,0x4F,0x20,0x00
#define HID_USAGE_SENSOR_UNITS_AMPERE							 0x67,0x01,0x00,0x10,0x00
#define HID_USAGE_SENSOR_UNITS_WATT								 0x66,0x21,0xD1
#define HID_USAGE_SENSOR_UNITS_HENRY							 0x67,0x21,0xE1,0xE0,0x00
#define HID_USAGE_SENSOR_UNITS_OHM								 0x67,0x21,0xD1,0xE0,0x00
#define HID_USAGE_SENSOR_UNITS_VOLT								 0x67,0x21,0xD1,0xF0,0x00
#define HID_USAGE_SENSOR_UNITS_HERTZ							 0x66,0x01,0xF0
#define HID_USAGE_SENSOR_UNITS_DEGREES							 0x65,0x14
#define HID_USAGE_SENSOR_UNITS_DEGREES_PER_SECOND				 0x66,0x14,0xF0
#define HID_USAGE_SENSOR_UNITS_DEGREES_PER_SEC_SQRD				 0x66,0x14,0xE0
#define HID_USAGE_SENSOR_UNITS_RADIANS							 0x65,0x12
#define HID_USAGE_SENSOR_UNITS_RADIANS_PER_SECOND				 0x66,0x12,0xF0
#define HID_USAGE_SENSOR_UNITS_RADIANS_PER_SEC_SQRD				 0x66,0x12,0xE0
#define HID_USAGE_SENSOR_UNITS_SECOND							 0x66,0x01,0x10
#define HID_USAGE_SENSOR_UNITS_GAUSS							 0x67,0x01,0xE1,0xF0,0x00
#define HID_USAGE_SENSOR_UNITS_GRAM								 0x66,0x01,0x01
#define HID_USAGE_SENSOR_UNITS_CENTIMETER						 0x65,0x11
                                                                 
#ifdef DEFINE_NON_HID_UNITS                                      
#define HID_USAGE_SENSOR_UNITS_CELSIUS							 �Use Unit(Kelvin) and subtract 273.15�
#define HID_USAGE_SENSOR_UNITS_KILOGRAM							 �Use Unit(gram) and UnitExponent(0x03)�
#define HID_USAGE_SENSOR_UNITS_METER							 �Use Unit(centimeter) and UnitExponent(0x02)�
#define HID_USAGE_SENSOR_UNITS_BAR								 �Use Unit(Pascal) and UnitExponent(0x05)�
#define HID_USAGE_SENSOR_UNITS_KNOT								 �Use Unit(m/s) and multiply by 1852/3600�
#define HID_USAGE_SENSOR_UNITS_PERCENT							 �Use Unit(Not_Specified)�
#define HID_USAGE_SENSOR_UNITS_G								 �Use Unit(m/s2) and divide by 9.8�
#define HID_USAGE_SENSOR_UNITS_MILLISECOND						 �Use Unit(second) and UnitExponent(0x0D)�
#define HID_USAGE_SENSOR_UNITS_MILLIGAUSS						 �Use Unit(Gauss) and UnitExponent(0x0D)�
#endif

//data type usage switches -- we use them as modifiers for sensor properties & data fields
//to create thresholds, for example.
//NOTE: the usage tables actually define these as two bytes, but in order
//to get the define macros to work so these are �or-ed� these are defined
//here as only one byte.
#define HID_USAGE_SENSOR_DATA_MOD_NONE							 0x00 // US
#define HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_ABS		 0x10 // US
#define HID_USAGE_SENSOR_DATA_MOD_MAX							 0x20 // US
#define HID_USAGE_SENSOR_DATA_MOD_MIN							 0x30 // US
#define HID_USAGE_SENSOR_DATA_MOD_ACCURACY						 0x40 // US
#define HID_USAGE_SENSOR_DATA_MOD_RESOLUTION					 0x50 // US
#define HID_USAGE_SENSOR_DATA_MOD_THRESHOLD_HIGH				 0x60 // US
#define HID_USAGE_SENSOR_DATA_MOD_THRESHOLD_LOW					 0x70 // US
#define HID_USAGE_SENSOR_DATA_MOD_CALIBRATION_OFFSET			 0x80 // US
#define HID_USAGE_SENSOR_DATA_MOD_CALIBRATION_MULTIPLIER		 0x90 // US
#define HID_USAGE_SENSOR_DATA_MOD_REPORT_INTERVAL				 0xA0 // US
#define HID_USAGE_SENSOR_DATA_MOD_FREQUENCY_MAX					 0xB0 // US
#define HID_USAGE_SENSOR_DATA_MOD_PERIOD_MAX					 0xC0 // US
#define HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_RANGE_PCT	 0xD0 // US
#define HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_REL_PCT	 0xE0 // US
#define HID_USAGE_SENSOR_DATA_MOD_VENDOR_RESERVED				 0xF0 // US
                                                                 
//state usages                                                   
#define HID_USAGE_SENSOR_STATE									 0x0A,0x01,0x02 // NAry
	//state selectors                                            
	#define HID_USAGE_SENSOR_STATE_UNKNOWN						 0x0A,0x00,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_READY						 0x0A,0x01,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_NOT_AVAILABLE				 0x0A,0x02,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_NO_DATA						 0x0A,0x03,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_INITIALIZING					 0x0A,0x04,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_ACCESS_DENIED				 0x0A,0x05,0x08 // Sel
	#define HID_USAGE_SENSOR_STATE_ERROR						 0x0A,0x06,0x08 // Sel
                                                                 
//event usages                                                   
#define HID_USAGE_SENSOR_EVENT									 0x0A,0x02,0x02 // NAry
	//event selectors                                            
	#define HID_USAGE_SENSOR_EVENT_UNKNOWN						 0x0A,0x10,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_STATE_CHANGED				 0x0A,0x11,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_PROPERTY_CHANGED				 0x0A,0x12,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_DATA_UPDATED					 0x0A,0x13,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_POLL_RESPONSE				 0x0A,0x14,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_CHANGE_SENSITIVITY			 0x0A,0x15,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_MAX_REACHED					 0x0A,0x16,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_MIN_REACHED					 0x0A,0x17,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_HIGH_THRESHOLD_CROSS_UPWARD	 0x0A,0x18,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_HIGH_THESHOLD_CROSS_ABOVE	 0x0A,0x18,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_HIGH_THRESHOLD_CROSS_DOWNWARD 0x0A,0x19,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_HIGH_THRESHOLD_CROSS_BELOW	 0x0A,0x19,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_LOW_THRESHOLD_CROSS_UPWARD	 0x0A,0x1A,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_LOW_THRESHOLD_CROSS_ABOVE	 0x0A,0x1A,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_LOW_THRESHOLD_CROSS_DOWNWARD	 0x0A,0x1B,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_LOW_THRESHOLD_CROSS_BELOW	 0x0A,0x1B,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_ZERO_THRESHOLD_CROSS_UPWARD	 0x0A,0x1C,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_ZERO_THRESHOLD_CROSS_ABOVE	 0x0A,0x1C,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_ZERO_THRESHOLD_CROSS_DOWNWARD 0x0A,0x1D,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_ZERO_THRESHOLD_CROSS_BELOW	 0x0A,0x1D,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_PERIOD_EXCEEDED				 0x0A,0x1E,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_FREQUENCY_EXCEEDED			 0x0A,0x1F,0x08 // Sel
	#define HID_USAGE_SENSOR_EVENT_COMPLEX_TRIGGER				 0x0A,0x20,0x08 // Sel
                                                                 
