trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
//property usages (get/set feature report)                       
#define HID_USAGE_SENSOR_PROPERTY								 0x0A,0x00,0x03
#define HID_USAGE_SENSOR_PROPERTY_FRIENDLY_NAME					 0x0A,0x01,0x03
#define HID_USAGE_SENSOR_PROPERTY_PERSISTENT_UNIQUE_ID			 0x0A,0x02,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_STATUS					 0x0A,0x03,0x03
#define HID_USAGE_SENSOR_PROPERTY_MINIMUM_REPORT_INTERVAL		 0x0A,0x04,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_MANUFACTURER			 0x0A,0x05,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_MODEL					 0x0A,0x06,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_SERIAL_NUMBER			 0x0A,0x07,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_DESCRIPTION			 0x0A,0x08,0x03
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_CONNECTION_TYPE		 0x0A,0x09,0x03 // NAry
	//begin connection type selectors
	#define HID_USAGE_SENSOR_PROPERTY_CONNECTION_TYPE_PC_INTEGRATED 0x0A,0x30,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_CONNECTION_TYPE_PC_ATTACHED	0x0A,0x31,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_CONNECTION_TYPE_PC_EXTERNAL	0x0A,0x32,0x08 // Sel
	//end connection type selectors                                 
#define HID_USAGE_SENSOR_PROPERTY_SENSOR_DEVICE_PATH				0x0A,0x0A,0x03
#define HID_USAGE_SENSOR_PROPERTY_HARDWARE_REVISION					0x0A,0x0B,0x03
#define HID_USAGE_SENSOR_PROPERTY_FIRMWARE_VERSION					0x0A,0x0C,0x03
#define HID_USAGE_SENSOR_PROPERTY_RELEASE_DATE						0x0A,0x0D,0x03
#define HID_USAGE_SENSOR_PROPERTY_REPORT_INTERVAL					0x0A,0x0E,0x03
#define HID_USAGE_SENSOR_PROPERTY_CHANGE_SENSITIVITY_ABS			0x0A,0x0F,0x03
#define HID_USAGE_SENSOR_PROPERTY_CHANGE_SENSITIVITY_RANGE_PCT		0x0A,0x10,0x03
#define HID_USAGE_SENSOR_PROPERTY_CHANGE_SENSITIVITY_REL_PCT		0x0A,0x11,0x03
#define HID_USAGE_SENSOR_PROPERTY_ACCURACY							0x0A,0x12,0x03
#define HID_USAGE_SENSOR_PROPERTY_RESOLUTION						0x0A,0x13,0x03
#define HID_USAGE_SENSOR_PROPERTY_RANGE_MAXIMUM						0x0A,0x14,0x03
#define HID_USAGE_SENSOR_PROPERTY_RANGE_MINIMUM						0x0A,0x15,0x03
#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE					0x0A,0x16,0x03 // NAry
	//begin reporting state selectors
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_NO_EVENTS				0x0A,0x40,0x08 // Sel
	#define HID_USAGE_REPORTING_STATE_ON_NONE								0x0A,0x40,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_ALL_EVENTS			0x0A,0x41,0x08 // Sel
	#define HID_USAGE_REPORTING_STATE_ON_ALL								0x0A,0x41,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_THRESHOLD_EVENTS		0x0A,0x42,0x08 // Sel
	#define HID_USAGE_REPORTING_STATE_ON_THRESHOLD							0x0A,0x42,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_NO_EVENTS_WAKE		0x0A,0x43,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_ALL_EVENTS_WAKE		0x0A,0x44,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_THRESHOLD_EVENTS_WAKE	0x0A,0x45,0x08 // Sel
	//end reporting state selectors
#define HID_USAGE_SENSOR_PROPERTY_SAMPLING_RATE							0x0A,0x17,0x03
#define HID_USAGE_SENSOR_PROPERTY_RESPONSE_CURVE						0x0A,0x18,0x03
#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE							0x0A,0x19,0x03 // NAry
	//begin power state selectors
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_UNDEFINED				0x0A,0x50,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_D0_FULL_POWER			0x0A,0x51,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_D1_LOW_POWER			0x0A,0x52,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_D2_STANDBY_WITH_WAKE	0x0A,0x53,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_D3_SLEEP_WITH_WAKE	0x0A,0x54,0x08 // Sel
	#define HID_USAGE_SENSOR_PROPERTY_POWER_STATE_D4_POWER_OFF			0x0A,0x55,0x08 // Sel
	//end power state selectors

//data type location
//data field usages (input report
#define HID_USAGE_SENSOR_DATA_LOCATION									 0x0A,0x00,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_DESIRED_ACCURACY					 0x0A,0x01,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ALTITUDE_ANTENNA_SEALEVEL		 0x0A,0x02,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_DIFFERENTIAL_REFERENCE_STATION_ID 0x0A,0x03,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ALTITIDE_ELIPSOID_ERROR			 0x0A,0x04,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ALTITIDE_ELIPSOID				 0x0A,0x05,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ALTITUDE_SEALEVEL_ERROR			 0x0A,0x06,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ALTITUDE_SEALEVEL				 0x0A,0x07,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_DGPS_DATA_AGE					 0x0A,0x08,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ERROR_RADIUS						 0x0A,0x09,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_FIX_QUALITY						 0x0A,0x0A,0x04 // NAry
	//begin fix quality selectors                                        
	#define HID_USAGE_SENSOR_DATA_FIX_QUALITY_NO_FIX					 0x0A,0x70,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_QUALITY_GPS						 0x0A,0x71,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_QUALITY_DGPS						 0x0A,0x72,0x08 // Sel
	//end fix quality selectors					                         
#define HID_USAGE_SENSOR_DATA_LOCATION_FIX_TYPE							 0x0A,0x0B,0x04 // NAry
	//begin fix type selectors                                           
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_NO_FIX						 0x0A,0x80,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_GPS_SPS_MODE_FIX_VALID		 0x0A,0x81,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_DGPS_SPS_MODE_FIX_VALID		 0x0A,0x82,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_GPS_PPS_MODE_FIX_VALID		 0x0A,0x83,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_REAL_TIME_KINEMATIC			 0x0A,0x84,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_FLOAT_RTK					 0x0A,0x85,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_ESTIMATED_DEAD_RECKONING		 0x0A,0x86,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_MANUAL_INPUT_MODE			 0x0A,0x87,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_FIX_TYPE_SIMULATOR_MODE				 0x0A,0x88,0x08 // Sel
	//end fix type selectors                                             
#define HID_USAGE_SENSOR_DATA_LOCATION_GEOIDAL_SEPARATION				 0x0A,0x0C,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_GPS_OPERATION_MODE				 0x0A,0x0D,0x04 // NAry
	//begin gps operation mode selectors                                 
	#define HID_USAGE_SENSOR_DATA_GPS_OP_MODE_MANUAL					 0x0A,0x90,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_OP_MODE_AUTOMATIC					 0x0A,0x91,0x08 // Sel
	//end gps operation mode selectors
#define HID_USAGE_SENSOR_DATA_LOCATION_GPS_SELECTION_MODE				 0x0A,0x0E,0x04 // NAry
	//begin gps selection mode selectors
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_AUTONOMOUS				 0x0A,0xA0,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_DGPS						 0x0A,0xA1,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_ESTIMATED_DEAD_RECKONING	 0x0A,0xA2,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_MANUAL_INPUT				 0x0A,0xA3,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_SIMULATOR				 0x0A,0xA4,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_SEL_MODE_DATA_NOT_VALID			 0x0A,0xA5,0x08 // Sel
	//end gps selection mode selectors
#define HID_USAGE_SENSOR_DATA_LOCATION_GPS_STATUS						 0x0A,0x0F,0x04 // NAry
	//begin gps status selectors                                         
	#define HID_USAGE_SENSOR_DATA_GPS_STATUS_DATA_VALID					 0x0A,0xB0,0x08 // Sel
	#define HID_USAGE_SENSOR_DATA_GPS_STATUS_DATA_NOT_VALID				 0x0A,0xB1,0x08 // Sel
	//end gps status selectors                                           
#define HID_USAGE_SENSOR_DATA_LOCATION_POSITION_DILUTION_OF_PRECISION	 0x0A,0x10,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_HORIZONTAL_DILUTION_OF_PRECISION	 0x0A,0x11,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_VERTICAL_DILUTION_OF_PRECISION	 0x0A,0x12,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_LATITUDE							 0x0A,0x13,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_LONGITUDE						 0x0A,0x14,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_TRUE_HEADING						 0x0A,0x15,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_MAGNETIC_HEADING					 0x0A,0x16,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_MAGNETIC_VARIATION				 0x0A,0x17,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SPEED							 0x0A,0x18,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW				 0x0A,0x19,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW_AZIMUTH		 0x0A,0x1A,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW_ELEVATION		 0x0A,0x1B,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW_ID			 0x0A,0x1C,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW_PRNs			 0x0A,0x1D,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_IN_VIEW_STN_RATIO		 0x0A,0x1E,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_USED_COUNT			 0x0A,0x1F,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_SATELLITES_USED_PRNs				 0x0A,0x20,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_NMEA_SENTENCE					 0x0A,0x21,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ADDRESS_LINE_1					 0x0A,0x22,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_ADDRESS_LINE_2					 0x0A,0x23,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_CITY								 0x0A,0x24,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_STATE_OR_PROVINCE				 0x0A,0x25,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_COUNTRY_OR_REGION				 0x0A,0x26,0x04
#define HID_USAGE_SENSOR_DATA_LOCATION_POSTAL_CODE						 0x0A,0x27,0x04
                                                                         
