trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_LOCATION								 0x0A,0x2A,0x04
#define HID_USAGE_SENSOR_PROPERTY_LOCATION_DESIRED_ACCURACY				 0x0A,0x2B,0x04 // NAry
	//begin location desired accuracy selectors                          
	#define HID_USAGE_SENSOR_DESIRED_ACCURACY_DEFAULT					 0x0A,0x60,0x08 // Sel
	#define HID_USAGE_SENSOR_DESIRED_ACCURACY_HIGH						 0x0A,0x61,0x08 // Sel
	#define HID_USAGE_SENSOR_DESIRED_ACCURACY_MEDIUM					 0x0A,0x62,0x08 // Sel
	#define HID_USAGE_SENSOR_DESIRED_ACCURACY_LOW						 0x0A,0x63,0x08 // Sel
//end location desired accuracy selectors                                
                                                                         
//data type environmental                                                
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL								 0x0A,0x30,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_ATMOSPHERIC_PRESSURE		 0x0A,0x31,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_REFERENCE_PRESSURE			 0x0A,0x32,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_RELATIVE_HUMIDITY			 0x0A,0x33,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_TEMPERATURE 				 0x0A,0x34,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_WIND_DIRECTION 				 0x0A,0x35,0x04
#define HID_USAGE_SENSOR_DATA_ENVIRONMENTAL_WIND_SPEED 					 0x0A,0x36,0x04
                                                                         
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_ENVIRONMENTAL 						 0x0A,0x40,0x04
#define HID_USAGE_SENSOR_PROPERTY_ENVIRONMENTAL_REFERENCE_PRESSURE 		 0x0A,0x41,0x04
                                                                         
//data type motion                                                       
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_MOTION 									 0x0A,0x50,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_STATE 								 0x0A,0x51,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION 						 0x0A,0x52,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION_X_AXIS 				 0x0A,0x53,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION_Y_AXIS 				 0x0A,0x54,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION_Z_AXIS 				 0x0A,0x55,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_VELOCITY 					 0x0A,0x56,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_VELOCITY_X_AXIS 			 0x0A,0x57,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_VELOCITY_Y_AXIS 			 0x0A,0x58,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_VELOCITY_Z_AXIS 			 0x0A,0x59,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_POSITION 					 0x0A,0x5A,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_POSITION_X_AXIS 			 0x0A,0x5B,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_POSITION_Y_AXIS 			 0x0A,0x5C,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_ANGULAR_POSITION_Z_AXIS 			 0x0A,0x5D,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_SPEED 								 0x0A,0x5E,0x04
#define HID_USAGE_SENSOR_DATA_MOTION_INTENSITY 							 0x0A,0x5F,0x04
                                                                         
//data type orientation                                                  
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_ORIENTATION 								 0x0A,0x70,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_HEADING 				 0x0A,0x71,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_HEADING_X 			 0x0A,0x72,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_HEADING_Y 			 0x0A,0x73,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_HEADING_Z 			 0x0A,0x74,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_COMPENSATED_MAGNETIC_NORTH 	 0x0A,0x75,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_COMPENSATED_TRUE_NORTH 		 0x0A,0x76,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_NORTH 				 0x0A,0x77,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_TRUE_NORTH 					 0x0A,0x78,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_DISTANCE 						 0x0A,0x79,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_DISTANCE_X 					 0x0A,0x7A,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_DISTANCE_Y 					 0x0A,0x7B,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_DISTANCE_Z 					 0x0A,0x7C,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_DISTANCE_OUT_OF_RANGE 		 0x0A,0x7D,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_TILT 							 0x0A,0x7E,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_TILT_X 						 0x0A,0x7F,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_TILT_Y 						 0x0A,0x80,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_TILT_Z 						 0x0A,0x81,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_ROTATION_MATRIX 				 0x0A,0x82,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_QUATERNION 					 0x0A,0x83,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_FLUX 				 0x0A,0x84,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_FLUX_X_AXIS 			 0x0A,0x85,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_FLUX_Y_AXIS 			 0x0A,0x86,0x04
#define HID_USAGE_SENSOR_DATA_ORIENTATION_MAGNETIC_FLUX_Z_AXIS 			 0x0A,0x87,0x04
                                                                         
//data type mechanical                                                   
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_MECHANICAL								 0x0A,0x90,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_BOOLEAN_SWITCH_STATE			 0x0A,0x91,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_BOOLEAN_SWITCH_ARRAY_STATES	 0x0A,0x92,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_MULTIVALUE_SWITCH_VALUE		 0x0A,0x93,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_FORCE							 0x0A,0x94,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_ABSOLUTE_PRESSURE				 0x0A,0x95,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_GAUGE_PRESSURE					 0x0A,0x96,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_STRAIN							 0x0A,0x97,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_WEIGHT							 0x0A,0x98,0x04
                                                                         
