trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_MECHANICAL							 0x0A,0xA0,0x04
#define HID_USAGE_SENSOR_PROPERTY_MECHANICAL_VIBRATION_STATE			 0x0A,0xA1,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_VIBRATION_SPEED_FORWARD		 0x0A,0xA2,0x04
#define HID_USAGE_SENSOR_DATA_MECHANICAL_VIBRATION_SPEED_BACKWARD		 0x0A,0xA3,0x04
	                                                                     
//data type biometric                                                    
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_BIOMETRIC									 0x0A,0xB0,0x04
#define HID_USAGE_SENSOR_DATA_BIOMETRIC_HUMAN_PRESENCE					 0x0A,0xB1,0x04
#define HID_USAGE_SENSOR_DATA_BIOMETRIC_HUMAN_PROXIMITY_RANGE			 0x0A,0xB2,0x04
#define HID_USAGE_SENSOR_DATA_BIOMETRIC_HUMAN_PROXIMITY_OUT_OF_RANGE	 0x0A,0xB3,0x04
#define HID_USAGE_SENSOR_DATA_BIOMETRIC_HUMAN_TOUCH_STATE				 0x0A,0xB4,0x04
	                                                                     
//data type light sensor                                                 
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_LIGHT 									 0x0A,0xD0,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_ILLUMINANCE 						 0x0A,0xD1,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_COLOR_TEMPERATURE 					 0x0A,0xD2,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_CHROMATICITY 						 0x0A,0xD3,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_CHROMATICITY_X 						 0x0A,0xD4,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_CHROMATICITY_Y 						 0x0A,0xD5,0x04
#define HID_USAGE_SENSOR_DATA_LIGHT_CONSUMER_IR_SENTENCE_RECEIVE 		 0x0A,0xD6,0x04
                                                                         
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_LIGHT 								 0x0A,0xE0,0x04
#define HID_USAGE_SENSOR_PROPERTY_LIGHT_CONSUMER_IR_SENTENCE_SEND 		 0x0A,0xE1,0x04
                                                                         
//data type scanner                                                      
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_SCANNER 									 0x0A,0xF0,0x04
#define HID_USAGE_SENSOR_DATA_SCANNER_RFID_TAG 							 0x0A,0xF2,0x04
#define HID_USAGE_SENSOR_DATA_SCANNER_NFC_SENTENCE_RECEIVE 				 0x0A,0xF3,0x04
                                                                         
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_SCANNER 								 0x0A,0xF8,0x04
#define HID_USAGE_SENSOR_PROPERTY_SCANNER_NFC_SENTENCE_SEND 			 0x0A,0xF8,0x04
	                                                                     
//data type electrical                                                   
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_ELECTRICAL 								 0x0A,0x00,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_CAPACITANCE 					 0x0A,0x01,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_CURRENT 						 0x0A,0x02,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_POWER 							 0x0A,0x03,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_INDUCTANCE 					 0x0A,0x04,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_RESISTANCE 					 0x0A,0x05,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_VOLTAGE 						 0x0A,0x06,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_FREQUENCY 						 0x0A,0x07,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_PERIOD 						 0x0A,0x08,0x05
#define HID_USAGE_SENSOR_DATA_ELECTRICAL_PERCENT_OF_RANGE 				 0x0A,0x09,0x05
	                                                                     
//data type time                                                         
//data field usages (input report)                                       
#define HID_USAGE_SENSOR_DATA_TIME 										 0x0A,0x20,0x05
#define HID_USAGE_SENSOR_DATA_TIME_YEAR 								 0x0A,0x21,0x05
#define HID_USAGE_SENSOR_DATA_TIME_MONTH 								 0x0A,0x22,0x05
#define HID_USAGE_SENSOR_DATA_TIME_DAY 									 0x0A,0x23,0x05
#define HID_USAGE_SENSOR_DATA_TIME_DAY_OF_WEEK 							 0x0A,0x24,0x05
#define HID_USAGE_SENSOR_DATA_TIME_HOUR 								 0x0A,0x25,0x05
#define HID_USAGE_SENSOR_DATA_TIME_MINUTE 								 0x0A,0x26,0x05
#define HID_USAGE_SENSOR_DATA_TIME_SECOND 								 0x0A,0x27,0x05
#define HID_USAGE_SENSOR_DATA_TIME_MILLISECOND 							 0x0A,0x28,0x05
#define HID_USAGE_SENSOR_DATA_TIME_TIMESTAMP 							 0x0A,0x29,0x05
#define HID_USAGE_SENSOR_DATA_TIME_JULIAN_DAY_OF_YEAR 					 0x0A,0x2A,0x05
	                                                                     
//property usages (get/set feature report)                               
#define HID_USAGE_SENSOR_PROPERTY_TIME 									 0x0A,0x30,0x05
#define HID_USAGE_SENSOR_PROPERTY_TIME_TIME_ZONE_OFFSET_FROM_UTC 		 0x0A,0x31,0x05
#define HID_USAGE_SENSOR_PROPERTY_TIME_TIME_ZONE_NAME 					 0x0A,0x32,0x05
#define HID_USAGE_SENSOR_PROPERTY_TIME_DAYLIGHT_SAVINGS_TIME_OBSERVED 	 0x0A,0x33,0x05
#define HID_USAGE_SENSOR_PROPERTY_TIME_TIME_TRIM_ADJUSTMENT 			 0x0A,0x34,0x05
#define HID_USAGE_SENSOR_PROPERTY_TIME_ARM_ALARM 						 0x0A,0x35,0x05

//data type custom 
//data field usages (input report) 
#define HID_USAGE_SENSOR_DATA_CUSTOM 							 0x0A,0x40,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_USAGE 						 0x0A,0x41,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_BOOLEAN_ARRAY 				 0x0A,0x42,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE 						 0x0A,0x43,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_1 					 0x0A,0x44,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_2 					 0x0A,0x45,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_3 					 0x0A,0x46,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_4  					 0x0A,0x47,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_5  					 0x0A,0x48,0x05
#define HID_USAGE_SENSOR_DATA_CUSTOM_VALUE_6  					 0x0A,0x49,0x05
 							
//data type generic
//data field usages (input report)
#define HID_USAGE_SENSOR_DATA_GENERIC							 0x0A,0x60,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_GUID_OR_PROPERTYKEY		 0x0A,0x61,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_CATEGORY_GUID				 0x0A,0x62,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_TYPE_GUID					 0x0A,0x63,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_EVENT_PROPERTYKEY			 0x0A,0x64,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_PROPERTY_PROPERTYKEY		 0x0A,0x65,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_DATAFIELD_PROPERTYKEY		 0x0A,0x66,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_EVENT						 0x0A,0x67,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_PROPERTY					 0x0A,0x68,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_DATAFIELD					 0x0A,0x69,0x05
#define HID_USAGE_SENSOR_DATA_ENUMERATOR_TABLE_ROW_INDEX		 0x0A,0x6A,0x05
#define HID_USAGE_SENSOR_DATA_ENUMERATOR_TABLE_ROW_COUNT		 0x0A,0x6B,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_GUID_OR_PROPERTYKEY_KIND	 0x0A,0x6C,0x05 // NAry
	//begin GorPK kind selectors
	#define HID_USAGE_SENSOR_GORPK_KIND_CATEGORY				 0x0A,0xD0,0x08 // Sel
	#define HID_USAGE_SENSOR_GORPK_KIND_TYPE					 0x0A,0xD1,0x08 // Sel
	#define HID_USAGE_SENSOR_GORPK_KIND_EVENT					 0x0A,0xD2,0x08 // Sel
	#define HID_USAGE_SENSOR_GORPK_KIND_PROPERTY				 0x0A,0xD3,0x08 // Sel
	#define HID_USAGE_SENSOR_GORPK_KIND_DATAFIELD				 0x0A,0xD4,0x08 // Sel
	//end GorPK kind selectors
#define HID_USAGE_SENSOR_DATA_GENERIC_GUID						 0x0A,0x6D,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_PROPERTYKEY				 0x0A,0x6E,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_TOP_LEVEL_COLLECTION_ID	 0x0A,0x6F,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_REPORT_ID					 0x0A,0x70,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_REPORT_ITEM_POSITION_INDEX 0x0A,0x71,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_FIRMWARE_VARTYPE			 0x0A,0x72,0x05 // NAry
	//begin firmware vartype selectors
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_NULL			 0x0A,0x00,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_BOOL			 0x0A,0x01,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_UI1			 0x0A,0x02,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_I1				 0x0A,0x03,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_UI2			 0x0A,0x04,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_I2				 0x0A,0x05,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_UI4			 0x0A,0x06,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_I4				 0x0A,0x07,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_UI8			 0x0A,0x08,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_I8				 0x0A,0x09,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_R4				 0x0A,0x0A,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_R8				 0x0A,0x0B,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_WSTR			 0x0A,0x0C,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_STR			 0x0A,0x0D,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_CLSID			 0x0A,0x0E,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_VECTOR_VT_UI1	 0x0A,0x0F,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E0			 0x0A,0x10,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E1			 0x0A,0x11,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E2			 0x0A,0x12,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E3			 0x0A,0x13,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E4			 0x0A,0x14,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E5			 0x0A,0x15,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E6			 0x0A,0x16,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E7			 0x0A,0x17,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E8			 0x0A,0x18,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16E9			 0x0A,0x19,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16EA			 0x0A,0x1A,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16EB			 0x0A,0x1B,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16EC			 0x0A,0x1C,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16ED			 0x0A,0x1D,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16EE			 0x0A,0x1E,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F16EF			 0x0A,0x1F,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E0			 0x0A,0x20,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E1			 0x0A,0x21,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E2			 0x0A,0x22,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E3			 0x0A,0x23,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E4			 0x0A,0x24,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E5			 0x0A,0x25,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E6			 0x0A,0x26,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E7			 0x0A,0x27,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E8			 0x0A,0x28,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32E9			 0x0A,0x29,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32EA			 0x0A,0x2A,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32EB			 0x0A,0x2B,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32EC			 0x0A,0x2C,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32ED			 0x0A,0x2D,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32EE			 0x0A,0x2E,0x09 // Sel
	#define HID_USAGE_SENSOR_FIRMWARE_VARTYPE_VT_F32EF			 0x0A,0x2F,0x09 // Sel	
	//end firmware vartype selectors
#define HID_USAGE_SENSOR_DATA_GENERIC_UNIT_OF_MEASURE			 0x0A,0x73,0x05 // NAry
	//begin unit of measure selectors
	#define HID_USAGE_SENSOR_GENERIC_UNIT_NOT_SPECIFIED			 0x0A,0x40,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_LUX					 0x0A,0x41,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_KELVIN		 0x0A,0x42,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_CELSIUS		 0x0A,0x43,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_PASCAL				 0x0A,0x44,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_NEWTON				 0x0A,0x45,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_METERS_PER_SECOND		 0x0A,0x46,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_KILOGRAM				 0x0A,0x47,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_METER					 0x0A,0x48,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_METERS_PER_SEC_SQRD	 0x0A,0x49,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_FARAD					 0x0A,0x4A,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_AMPERE				 0x0A,0x4B,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_WATT					 0x0A,0x4C,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_HENRY					 0x0A,0x4D,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_OHM					 0x0A,0x4E,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_VOLT					 0x0A,0x4F,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_HERTZ					 0x0A,0x50,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_BAR					 0x0A,0x51,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_ANTI_CLOCKWISE 0x0A,0x52,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_CLOCKWISE		 0x0A,0x53,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES				 0x0A,0x54,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_PER_SECOND	 0x0A,0x55,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_DEGREES_PER_SEC_SQRD	 0x0A,0x56,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_KNOT					 0x0A,0x57,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_PERCENT				 0x0A,0x58,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_SECOND				 0x0A,0x59,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_MILLISECOND			 0x0A,0x5A,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_G						 0x0A,0x5B,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_BYTES					 0x0A,0x5C,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_MILLIGAUSS			 0x0A,0x5D,0x09 // Sel
	#define HID_USAGE_SENSOR_GENERIC_UNIT_BITS					 0x0A,0x5E,0x09 // Sel
	//end unit of measure selectors
#define HID_USAGE_SENSOR_DATA_GENERIC_UNIT_EXPONENT				 0x0A,0x74,0x05 // NAry
	//begin unit exponent selectors
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_0					 0x0A,0x70,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_1					 0x0A,0x71,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_2					 0x0A,0x72,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_3					 0x0A,0x73,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_4					 0x0A,0x74,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_5					 0x0A,0x75,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_6					 0x0A,0x76,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_7					 0x0A,0x77,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_8					 0x0A,0x78,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_9					 0x0A,0x79,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_A					 0x0A,0x7A,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_B					 0x0A,0x7B,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_C					 0x0A,0x7C,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_D					 0x0A,0x7D,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_E					 0x0A,0x7E,0x09 //Sel
	#define HID_USAGE_SENSOR_GENERIC_EXPONENT_F					 0x0A,0x7F,0x09 //Sel
	//end unit exponent selectors
#define HID_USAGE_SENSOR_DATA_GENERIC_REPORT_SIZE				 0x0A,0x75,0x05
#define HID_USAGE_SENSOR_DATA_GENERIC_REPORT_COUNT				 0x0A,0x76,0x05

