trevorcmit/DA14585_RCU/projects/target_apps/rcu/src/app_hogpd_defs.h
//property usages (get/set feature report)
#define HID_USAGE_SENSOR_PROPERTY_GENERIC						 0x0A,0x80,0x05
#define HID_USAGE_SENSOR_PROPERTY_ENUMERATOR_TABLE_ROW_INDEX	 0x0A,0x81,0x05
#define HID_USAGE_SENSOR_PROPERTY_ENUMERATOR_TABLE_ROW_COUNT	 0x0A,0x82,0x05

////////////////////////////////////////////////////////////////////////////////////
//
// Other HID definitions
//
////////////////////////////////////////////////////////////////////////////////////

//NOTE: These definitions are designed to permit compiling the HID report descriptors
// with somewhat self-explanatory information to help readability and reduce errors

//input,output,feature flags
//#define HID_DATA_ARR_ABS	 0x00
//#define HID_CONST_ARR_ABS	 0x01
//#define HID_DATA_VAR_ABS	 0x02
//#define HID_CONST_VAR_ABS	 0x03
//#define HID_DATA_VAR_REL	 0x06

#define HID_DATA_BIT      0x00
#define HID_CONST_BIT     0x01
                        
#define HID_ARY_BIT       0x00
#define HID_VAR_BIT       0x02
                        
#define HID_ABS_BIT       0x00
#define HID_REL_BIT       0x04
                        
#define HID_NWRP_BIT      0x00
#define HID_WRP_BIT       0x08
                        
#define HID_LIN_BIT       0x00
#define HID_NLIN_BIT      0x10
                        
#define HID_PREF_BIT      0x00
#define HID_NPREF_BIT     0x20
                        
#define HID_NNUL_BIT      0x00
#define HID_NUL_BIT       0x40
                        
#define HID_NVOL_BIT      0x00
#define HID_VOL_BIT       0x08

//collection flags
#define HID_PHYSICAL	  0x00
#define HID_APPLICATION	  0x01
#define HID_LOGICAL		  0x02
#define HID_NAMED_ARRAY	  0x04
#define HID_USAGE_SWITCH  0x05

// Usage Pages (HID Usage Tables 1.12 Section 3, Table 1)
#define HID_USAGE_PAGE_GENERIC_DESKTOP 0x01
#define HID_USAGE_PAGE_KEY_CODES       0x07
#define HID_USAGE_PAGE_LEDS            0x08
#define HID_USAGE_PAGE_BUTTONS         0x09
#define HID_USAGE_PAGE_CONSUMER        0x0C

// Generic Desktop Page Usages (HID Usage Tables 1.12 Section 4, Table 6)
#define HID_GEN_DESKTOP_USAGE_POINTER  0x01
#define HID_GEN_DESKTOP_USAGE_MOUSE    0x02
#define HID_GEN_DESKTOP_USAGE_JOYSTICK 0x04
#define HID_GEN_DESKTOP_USAGE_KEYBOARD 0x06
#define HID_GEN_DESKTOP_USAGE_X        0x30
#define HID_GEN_DESKTOP_USAGE_Y        0x31
#define HID_GEN_DESKTOP_USAGE_Z        0x32
#define HID_GEN_DESKTOP_USAGE_RX       0x33
#define HID_GEN_DESKTOP_USAGE_RY       0x34
#define HID_GEN_DESKTOP_USAGE_RZ       0x35
#define HID_GEN_DESKTOP_USAGE_WHEEL    0x38

// Consumer Usages (HID Usage Tables 1.12 Section 4, Table 6)
#define HID_CONSUMER_USAGE_CONSUMER_CONTROL         0x01
#define HID_CONSUMER_USAGE_NUMERIC_KEY_PAD          0x02
#define HID_CONSUMER_USAGE_PROGRAMMABLE_BUTTONS     0x03

//other
#define HID_UNDEFINED					0x00
#define HID_USAGE_PAGE(a)				0x05,a
#define HID_USAGE_PAGE_VENDOR_DEFINED	0x06,0x00,0xFF
#define HID_USAGE(a)					0x09,a
#define HID_USAGE16(a,b)				0x0A,a,b
#define HID_USAGE_SENSOR_DATA(a,b)		a|b			//This or-s the mod into usage
#define HID_COLLECTION(a)				0xA1,a
#define HID_REPORT_ID(a)				0x85,a
#define HID_REPORT_SIZE(a)				0x75,a
#define HID_REPORT_COUNT(a)				0x95,a
#define HID_USAGE_MIN_8(a)				0x19,a
#define HID_USAGE_MIN_16(a,b)			0x1A,a,b
#define HID_USAGE_MAX_8(a)				0x29,a
#define HID_USAGE_MAX_16(a,b)			0x2A,a,b
#define HID_LOGICAL_MIN_8(a)			0x15,a
#define HID_LOGICAL_MIN_16(a,b)			0x16,a,b
#define HID_LOGICAL_MIN_32(a,b,c,d)		0x17,a,b,cd
#define HID_LOGICAL_MAX_8(a)			0x25,a
#define HID_LOGICAL_MAX_16(a,b)			0x26,a,b
#define HID_LOGICAL_MAX_32(a,b,c,d)		0x27,a,b,c,d
#define HID_UNIT_EXPONENT(a)			0x55,a
#define HID_INPUT(a)					0x81,a
#define HID_OUTPUT(a)					0x91,a
#define HID_FEATURE(a)					0xB1,a
#define HID_END_COLLECTION				0xC0

#endif // _APP_HOGPD_DEFS_H_
